let lv103 = ゲーム(
  瓶s: [
    .init([.水, .黄, .橙, .黄緑]),
    .init([.水, .緑, .黄, .鶯]),
    .init([.紫, .黄緑, .赤, .青]),
    .init([.黄, .水, .赤, .灰]),
    .init([.鶯, .桃, .青, .黄]),
    .init([.茶, .鶯, .茶, .緑]),
    .init([.茶, .青, .紫, .赤]),
    .init([.紫, .桃, .青, .茶]),
    .init([.灰, .桃, .黄緑, .灰]),
    .init([.橙, .黄緑, .緑, .水]),
    .init([.鶯, .灰, .紫, .赤]),
    .init([.桃, .橙, .緑, .橙]),
    .init([]),
    .init([]),
  ], 最大値: 4)

let lv104 = ゲーム(
  瓶s: [
    .init([.灰, .黄緑, .桃, .水]),
    .init([.橙, .桃, .桃, .灰]),
    .init([.赤, .緑, .桃, .赤]),
    .init([.橙, .青, .水, .紫]),
    .init([.緑, .赤, .黄緑, .紫]),
    .init([.青, .灰, .紫, .赤]),
    .init([.紫, .青, .青, .水]),
    .init([.橙, .緑, .緑, .水]),
    .init([.黄緑, .灰, .橙, .黄緑]),
    .init([]),
    .init([]),
  ], 最大値: 4)

let lv105 = ゲーム(
  瓶s: [
    .init([.青, .鶯, .水, .水]),
    .init([.紫, .桃, .緑, .灰]),
    .init([.橙, .紫, .赤, .茶]),
    .init([.橙, .桃, .赤, .橙]),
    .init([.鶯, .赤, .黄, .青]),
    .init([.黄, .鶯, .茶, .鶯]),
    .init([.茶, .紫, .赤, .黄緑]),
    .init([.黄緑, .紫, .桃, .黄緑]),
    .init([.緑, .灰, .水, .青]),
    .init([.茶, .黄, .灰, .緑]),
    .init([.灰, .黄, .黄緑, .青]),
    .init([.緑, .水, .桃, .橙]),
    .init([]),
    .init([]),
  ], 最大値: 4)
